// API callback
showurl({"version":"1.0","encoding":"UTF-8","feed":{"xmlns":"http://www.w3.org/2005/Atom","xmlns$openSearch":"http://a9.com/-/spec/opensearchrss/1.0/","xmlns$gd":"http://schemas.google.com/g/2005","xmlns$georss":"http://www.georss.org/georss","xmlns$thr":"http://purl.org/syndication/thread/1.0","xmlns$blogger":"http://schemas.google.com/blogger/2008","id":{"$t":"tag:blogger.com,1999:blog-7425602396900935595"},"updated":{"$t":"2020-05-28T02:09:40.280-07:00"},"title":{"type":"text","$t":"GoupLink Encryption - Encrypt Your Link"},"subtitle":{"type":"html","$t":"Encrypting your link and protect the link from viruses, malware, thief, etc! Made your link safe to visit."},"link":[{"rel":"http://schemas.google.com/g/2005#feed","type":"application/atom+xml","href":"https://www.blogger.com/feeds/7425602396900935595/posts/default?alt\u003djson-in-script\u0026max-results\u003d150"},{"rel":"self","type":"application/atom+xml","href":"https://www.blogger.com/feeds/7425602396900935595/posts/default?alt\u003djson-in-script\u0026max-results\u003d150"},{"rel":"alternate","type":"text/html","href":"https://goulink.blogspot.com/"},{"rel":"hub","href":"http://pubsubhubbub.appspot.com/"}],"author":[{"name":{"$t":"Vishal Rana"},"uri":{"$t":"https://www.blogger.com/profile/06851534161250839479"},"email":{"$t":"noreply@blogger.com"},"gd$image":{"rel":"http://schemas.google.com/g/2005#thumbnail","width":"24","height":"32","src":"//4.bp.blogspot.com/-7lfJiZdE8sQ/XPZhH1vAyhI/AAAAAAAAH1c/-pWXD6CfJpQJpdBlnyGLCZuQuB8RlAHqwCK4BGAYYCw/s32/14051628_1669839046671326_5755928511310764718_n.jpg"}}],"generator":{"version":"7.00","uri":"https://www.blogger.com","$t":"Blogger"},"openSearch$totalResults":{"$t":"1"},"openSearch$startIndex":{"$t":"1"},"openSearch$itemsPerPage":{"$t":"150"},"entry":[{"id":{"$t":"tag:blogger.com,1999:blog-7425602396900935595.post-5547753128678175368"},"published":{"$t":"2020-01-17T22:42:00.001-08:00"},"updated":{"$t":"2020-01-17T22:42:14.652-08:00"},"title":{"type":"text","$t":"Insurance Policy"},"content":{"type":"html","$t":"\u003cdiv dir\u003d\"ltr\" style\u003d\"text-align: left;\" trbidi\u003d\"on\"\u003e\u003ch2 style\u003d\"text-align: left;\"\u003eInsurance Two Wheeler Policy Overview\u003c/h2\u003e\u003cdiv\u003e\u003cbr /\u003eThe National Insurance Company is India's largest and oldest general insurance company that offers customized and comprehensive insurance plans. It is the only public sector general insurance company to initiate product optimization of both corporate and rural insurance plans. General insurance of this group is an important area where the company promises to deliver a product that meets the needs of the common man. There are multiple insurance plans such as motor insurance plans, two-wheeler insurance plans, health insurance plans, rural insurance plans, industrial insurance plans, commercial risk insurance plans, personal accident plans, home insurance plans and other types of insurance, which tailors and customers. Friendly and fully transparent\u003cbr /\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 style\u003d\"text-align: left;\"\u003eHere we will discuss the National Insurance Two Wheeler Insurance Plans.\u003c/h2\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003ch2 style\u003d\"text-align: left;\"\u003eWhy two-wheeler insurance plans are required?\u003c/h2\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003eTwo-wheeler vehicles have always been considered important assets of our lives. But driving a two-wheeler vehicle is always dangerous and really risky and we always have to be careful and cautious. But accidents can happen at any time due to not following traffic rules or due to some untoward incidents. And this is the reason why auto insurance plans should be availed to protect yourself and cover all unexpected expenses. Not only that, but natural disasters can also happen at any time and protection against such an unpleasant event is also very important. So it is of utmost importance to avail the car insurance plan because:\u003c/div\u003e\u003cdiv\u003e\u003cul style\u003d\"text-align: left;\"\u003e\u003cli\u003eProtecting a two-wheeler vehicle is one of the most important assets and investments.\u003c/li\u003e\u003cli\u003ePlans allow payment of medical bills in case of accident.\u003c/li\u003e\u003cli\u003eIn case of accident related litigation the insurance company will take care whether the car insurance plan has been availed.\u003c/li\u003e\u003cli\u003eThis plan protects assets lost due to litigation for which the person has worked hard. And the plans hold the insurance holder to ensure the best value to be paid to the person.\u003c/li\u003e\u003cli\u003eThe car insurance plan pays not only for accidents and natural disasters but also for theft and vandalism. Plans are very well designed and are customized to meet the requirements.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003eEventually; When the insurance holder walks out with his two-wheeler there is peace of mind. He knows that he has car insurance plans which will take care of him and the car in case of any unforeseen circumstances.\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003eEvery two-wheeler owner must have an insurance plan that provides coverage for third party injury, death or property damage. Therefore, National Insurance provides a comprehensive two-wheeler insurance plan that protects the vehicle from any untoward incidents. Two-wheeler insurance plans should be chosen very carefully so that the plan covers the safety of self and vehicle.\u003cbr /\u003e\u003cbr /\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 style\u003d\"text-align: left;\"\u003eWhy take a National Insurance Two-Wheeler Insurance Policy?\u003c/h2\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e\u003cul style\u003d\"text-align: left;\"\u003e\u003cli\u003eNational insurance two-wheeler insurance plans have some unique features and benefits which are as follows:\u003c/li\u003e\u003cli\u003eLow cost insurance plans with customized coverage are available.\u003c/li\u003e\u003cli\u003eFast and hassle free cashless claim service is available.\u003c/li\u003e\u003cli\u003eA no claim bonus is also available.\u003c/li\u003e\u003cli\u003e\u0026nbsp;Swift and faster claim settlement process.\u003c/li\u003e\u003cli\u003eOne can find the claim status online.\u003c/li\u003e\u003cli\u003eThe existing No Claim Bonus can be transferred from any other insurance company. Here we will see the overview of the National Insurance Two-Wheeler Insurance Plan.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 style\u003d\"text-align: left;\"\u003eNational Insurance Two-Wheeler Policy Coverage\u003c/h2\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003ch2 style\u003d\"text-align: left;\"\u003eThere are two types of covers which are available under the plan, namely:\u003c/h2\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e\u003cul style\u003d\"text-align: left;\"\u003e\u003cli\u003eLiability only cover: This plan is against any legal liability after an accident. It covers the risks mentioned below: Package Cover: Under this plan, it covers all the liabilities as per the Motor Vehicles Act, as well as the losses caused by the vehicle. It is a comprehensive motor plan covering the risks of third parties and loss of own vehicle, co-passenger or self. The following reasons are included in the plan due to loss of own vehicle to the insurance holder:\u003c/li\u003e\u003cli\u003eThird party injury or death\u003c/li\u003e\u003cli\u003eProperty damage (Third party property damage up to Rs 7.5 lakh)\u003c/li\u003e\u003cli\u003eWhirling, housebreaking or theft in the house: This plan covers expenses that have to be incurred under burglary, housebreaking or theft.\u003c/li\u003e\u003cli\u003eFire, explosion, self-ignition or light: This plan covers the expenses that a fire, explosion has to bear.\u003c/li\u003e\u003cli\u003eMalicious Act: The plan also includes malicious acts.\u003c/li\u003e\u003cli\u003eTerrorist Act: Human activities of terrorists have also been included in this plan.\u003c/li\u003e\u003cli\u003eRiot and strike: Under this plan, riots and strike are also included. Earthquake and fire: both land\u003c/li\u003e\u003cli\u003eKamp and fire are considered the most common occurrence in the life cycle\u003c/li\u003e\u003cli\u003eTherefore, this plan also covers these two important unpleasant events.\u003c/li\u003e\u003cli\u003eIncidents involving external means.\u003c/li\u003e\u003cli\u003eNatural disasters like flood, typhoon, hurricane, hurricane, cyclone, hail, storm and inundation have also been included under this plan.\u003c/li\u003e\u003cli\u003eLandslide or Rockslide is covered under the package plan.\u003c/li\u003e\u003c/ul\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 style\u003d\"text-align: left;\"\u003eSubject to depreciation deduction at the rates mentioned below in respect of parts:\u003c/h2\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003eI) For all rubber / nylon / plastic parts, tires, tubes and batteries - 50%\u003c/div\u003e\u003cdiv\u003eIi) For fiber glass components - 30%\u003c/div\u003e\u003cdiv\u003eIii) For all parts made of glass - zero\u003c/div\u003e\u003cdiv\u003eIv) Depreciation rate for all other parts including the wooden parts as per the schedule given below:\u003cbr /\u003e\u003cbr /\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 style\u003d\"text-align: left;\"\u003eThe important exclusions are as follows:\u003c/h2\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e\u003cul style\u003d\"text-align: left;\"\u003e\u003cli\u003econsequential loss\u003c/li\u003e\u003cli\u003eWear and tear\u003c/li\u003e\u003cli\u003eDriving with an illegal driving license and alcohol consumption\u003c/li\u003e\u003cli\u003eCivil war, loss due to war\u003c/li\u003e\u003cli\u003eUse over personal purposes and limitations\u003c/li\u003e\u003cli\u003eUse over specified limits\u003c/li\u003e\u003cli\u003eDamage to tires and tubes until the two-wheeler vehicle itself has been damaged. Under this plan, the company will pay only 50% of the replacement cost.\u003c/li\u003e\u003cli\u003eLoss or damage to goods due to house breaking or theft\u003c/li\u003e\u003cli\u003eAny accidental loss due to consumption of alcohol, drugs.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e"},"link":[{"rel":"replies","type":"application/atom+xml","href":"https://url.presentblogging.com/feeds/5547753128678175368/comments/default","title":"Post Comments"},{"rel":"replies","type":"text/html","href":"https://goulink.blogspot.com/p/poliza-de-seguro.html","title":"0 Comments"},{"rel":"edit","type":"application/atom+xml","href":"https://www.blogger.com/feeds/7425602396900935595/posts/default/5547753128678175368"},{"rel":"self","type":"application/atom+xml","href":"https://www.blogger.com/feeds/7425602396900935595/posts/default/5547753128678175368"},{"rel":"alternate","type":"text/html","href":"https://goulink.blogspot.com/p/poliza-de-seguro.html","title":"Insurance Policy"}],"author":[{"name":{"$t":"Vishal Rana"},"uri":{"$t":"https://www.blogger.com/profile/06851534161250839479"},"email":{"$t":"noreply@blogger.com"},"gd$image":{"rel":"http://schemas.google.com/g/2005#thumbnail","width":"24","height":"32","src":"//4.bp.blogspot.com/-7lfJiZdE8sQ/XPZhH1vAyhI/AAAAAAAAH1c/-pWXD6CfJpQJpdBlnyGLCZuQuB8RlAHqwCK4BGAYYCw/s32/14051628_1669839046671326_5755928511310764718_n.jpg"}}],"thr$total":{"$t":"0"}}]}});
